# taps
tap "homebrew/bundle"
tap "hashicorp/tap"
tap "nats-io/homebrew-nats-tools"
tap "shivammathur/php"
tap "shivammathur/extensions"
tap "sst/tap"
tap "keidarcy/tap"
tap "danvergara/tools"

# casks
cask "1password-cli"
cask "session-manager-plugin"
cask "microsoft-teams", greedy: true
cask "mysql-shell"
cask "obsidian"
cask "postman"
cask "stats"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "yubico-yubikey-manager"

# brews
brew "awscli"
brew "azure-cli"
brew "bat"
brew "coreutils"
brew "curl"
brew "dblab"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "act"
brew "ratchet"
brew "git-crypt"
brew "glab"
brew "golangci-lint"
brew "gnupg"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "terragrunt"
brew "opentofu"
brew "htop"
brew "jq"
brew "k9s"
brew "keidarcy/tap/e1s"
brew "kubectl"
brew "lazygit"
brew "mysql-client"
brew "nats-io/homebrew-nats-tools/nats"
brew "neovim"
brew "nmap"
brew "node"
brew "pnpm"
brew "composer"
brew "php-cs-fixer"
brew "phpstan"
brew "shivammathur/php/php@8.3"
brew "shivammathur/extensions/redis@8.3"
brew "shivammathur/extensions/grpc@8.3"
brew "shivammathur/extensions/opentelemetry@8.3"
brew "postgresql@17"
brew "speedtest-cli"
brew "ripgrep"
brew "temporal"
brew "tflint"
brew "tldr"
brew "tmux"
brew "tree"
brew "trivy"
brew "unzip"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "zip"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
